; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_49)

(:domain logistics)

(:objects
	obj0 obj6 obj8 - airport
	obj1 obj7 obj9 - city
	obj2 obj3 obj4 obj5 obj16 obj18 obj19 obj20 obj21 obj22 - location
	obj10 obj11 obj12 obj13 - truck
	obj14 obj15 - package
	obj17 - airplane
)

(:init
	(at obj10 obj8)
	(at obj11 obj6)
	(at obj12 obj0)
	(at obj13 obj0)
	(at obj14 obj4)
	(at obj15 obj8)
	(at obj17 obj6)
	(in-city obj0 obj1)
	(in-city obj2 obj1)
	(in-city obj3 obj1)
	(in-city obj4 obj1)
	(in-city obj5 obj1)
	(in-city obj6 obj7)
	(in-city obj8 obj9)
	(in-city obj16 obj9)
	(in-city obj18 obj7)
	(in-city obj19 obj7)
	(in-city obj20 obj7)
	(in-city obj21 obj7)
	(in-city obj22 obj7)
)

(:goal (and
	(at obj14 obj5)
	(at obj15 obj22)
))
)

; plan
1. (drive obj11 obj6 obj18)
   deleted: (at obj11 obj6)
   added: (at obj11 obj18)
   goals met: 0 of 2
2. (drive obj12 obj0 obj4)
   deleted: (at obj12 obj0)
   added: (at obj12 obj4)
   goals met: 0 of 2
3. (drive obj13 obj0 obj2)
   deleted: (at obj13 obj0)
   added: (at obj13 obj2)
   goals met: 0 of 2
4. (fly obj17 obj6 obj8)
   deleted: (at obj17 obj6)
   added: (at obj17 obj8)
   goals met: 0 of 2
5. (load obj12 obj14 obj4)
   deleted: (at obj14 obj4)
   added: (in obj14 obj12)
   goals met: 0 of 2
6. (load obj17 obj15 obj8)
   deleted: (at obj15 obj8)
   added: (in obj15 obj17)
   goals met: 0 of 2
7. (drive obj12 obj4 obj0)
   deleted: (at obj12 obj4)
   added: (at obj12 obj0)
   goals met: 0 of 2
8. (fly obj17 obj8 obj6)
   deleted: (at obj17 obj8)
   added: (at obj17 obj6)
   goals met: 0 of 2
9. (drive obj11 obj18 obj6)
   deleted: (at obj11 obj18)
   added: (at obj11 obj6)
   goals met: 0 of 2
10. (drive obj13 obj2 obj0)
   deleted: (at obj13 obj2)
   added: (at obj13 obj0)
   goals met: 0 of 2
11. (unload obj12 obj14 obj0)
   deleted: (in obj14 obj12)
   added: (at obj14 obj0)
   goals met: 0 of 2
12. (unload obj17 obj15 obj6)
   deleted: (in obj15 obj17)
   added: (at obj15 obj6)
   goals met: 0 of 2
13. (fly obj17 obj6 obj8)
   deleted: (at obj17 obj6)
   added: (at obj17 obj8)
   goals met: 0 of 2
14. (drive obj13 obj0 obj3)
   deleted: (at obj13 obj0)
   added: (at obj13 obj3)
   goals met: 0 of 2
15. (fly obj17 obj8 obj6)
   deleted: (at obj17 obj8)
   added: (at obj17 obj6)
   goals met: 0 of 2
16. (load obj11 obj15 obj6)
   deleted: (at obj15 obj6)
   added: (in obj15 obj11)
   goals met: 0 of 2
17. (load obj12 obj14 obj0)
   deleted: (at obj14 obj0)
   added: (in obj14 obj12)
   goals met: 0 of 2
18. (drive obj11 obj6 obj22)
   deleted: (at obj11 obj6)
   added: (at obj11 obj22)
   goals met: 0 of 2
19. (drive obj12 obj0 obj5)
   deleted: (at obj12 obj0)
   added: (at obj12 obj5)
   goals met: 0 of 2
20. (drive obj10 obj8 obj16)
   deleted: (at obj10 obj8)
   added: (at obj10 obj16)
   goals met: 0 of 2
21. (drive obj13 obj3 obj5)
   deleted: (at obj13 obj3)
   added: (at obj13 obj5)
   goals met: 0 of 2
22. (unload obj11 obj15 obj22)
   deleted: (in obj15 obj11)
   added: (at obj15 obj22)
   goals met: 1 of 2
23. (unload obj12 obj14 obj5)
   deleted: (in obj14 obj12)
   added: (at obj14 obj5)
   goals met: 2 of 2
